In [1]:
import pandas as pd

test_data = pd.read_csv('test.csv')
train_data = pd.read_csv('train.csv')

In [2]:
train_labels = train_data['Survived']

In [3]:
train_data.drop(['Survived', 'PassengerId', 'Name', 'Ticket', 'Cabin'], axis = 1, inplace = True)

In [4]:
train_data

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         3    male  22.0      1      0   7.2500        S
1         1  female  38.0      1      0  71.2833        C
2         3  female  26.0      0      0   7.9250        S
3         1  female  35.0      1      0  53.1000        S
4         3    male  35.0      0      0   8.0500        S
..      ...     ...   ...    ...    ...      ...      ...
886       2    male  27.0      0      0  13.0000        S
887       1  female  19.0      0      0  30.0000        S
888       3  female   NaN      1      2  23.4500        S
889       1    male  26.0      0      0  30.0000        C
890       3    male  32.0      0      0   7.7500        Q

[891 rows x 7 columns]

In [5]:
train_labels

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [6]:
for col in train_data.columns: 
    print(col , ":" , train_data[col].isnull().sum())

Pclass : 0
Sex : 0
Age : 177
SibSp : 0
Parch : 0
Fare : 0
Embarked : 2

In [8]:
train_data['Sex'] = train_data.Sex.map({"male":1, "female":0})

In [9]:
train_data['Embarked'] = train_data.Embarked.map({"C":0, "Q":1, "S" :2})

In [10]:
train_data

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         3    1  22.0      1      0   7.2500       2.0
1         1    0  38.0      1      0  71.2833       0.0
2         3    0  26.0      0      0   7.9250       2.0
3         1    0  35.0      1      0  53.1000       2.0
4         3    1  35.0      0      0   8.0500       2.0
..      ...  ...   ...    ...    ...      ...       ...
886       2    1  27.0      0      0  13.0000       2.0
887       1    0  19.0      0      0  30.0000       2.0
888       3    0   NaN      1      2  23.4500       2.0
889       1    1  26.0      0      0  30.0000       0.0
890       3    1  32.0      0      0   7.7500       1.0

[891 rows x 7 columns]

In [11]:
for col in train_data.columns: 
    print(col , ":" , train_data[col].isnull().sum())

Pclass : 0
Sex : 0
Age : 177
SibSp : 0
Parch : 0
Fare : 0
Embarked : 2

In [12]:
train_data['Age'] = train_data['Age'].fillna(train_data['Age'].median())

In [13]:
train_data

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         3    1  22.0      1      0   7.2500       2.0
1         1    0  38.0      1      0  71.2833       0.0
2         3    0  26.0      0      0   7.9250       2.0
3         1    0  35.0      1      0  53.1000       2.0
4         3    1  35.0      0      0   8.0500       2.0
..      ...  ...   ...    ...    ...      ...       ...
886       2    1  27.0      0      0  13.0000       2.0
887       1    0  19.0      0      0  30.0000       2.0
888       3    0  28.0      1      2  23.4500       2.0
889       1    1  26.0      0      0  30.0000       0.0
890       3    1  32.0      0      0   7.7500       1.0

[891 rows x 7 columns]

In [14]:
train_data['Embarked'] = train_data['Embarked'].fillna(train_data['Embarked'].median())

In [15]:
for col in train_data.columns: 
    print(col , ":" , train_data[col].isnull().sum())

Pclass : 0
Sex : 0
Age : 0
SibSp : 0
Parch : 0
Fare : 0
Embarked : 0

In [16]:
from sklearn.model_selection import train_test_split
trainData , valData, trainLabels, valLabels = (train_test_split(train_data, train_labels,train_size=0.76))

In [17]:
from sklearn import tree

decision_tree = tree.DecisionTreeClassifier(max_depth = 3)
model = decision_tree.fit(trainData, trainLabels)

In [18]:
trainData

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
832       3    1  28.0      0      0    7.2292       0.0
65        3    1  28.0      1      1   15.2458       0.0
243       3    1  22.0      0      0    7.1250       2.0
283       3    1  19.0      0      0    8.0500       2.0
389       2    0  17.0      0      0   12.0000       0.0
..      ...  ...   ...    ...    ...       ...       ...
392       3    1  28.0      2      0    7.9250       2.0
339       1    1  45.0      0      0   35.5000       2.0
198       3    0  28.0      0      0    7.7500       1.0
698       1    1  49.0      1      1  110.8833       0.0
255       3    0  29.0      0      2   15.2458       0.0

[677 rows x 7 columns]

In [19]:
accuracy = model.score(valData, valLabels) * 100
accuracy

78.50467289719626

In [20]:
test_data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [21]:
import pandas as pd

test_data = pd.read_csv('test.csv')

In [22]:
test_data.drop([ 'PassengerId', 'Name', 'Ticket', 'Cabin'], axis = 1, inplace = True)

In [23]:
for col in test_data.columns: 
    print(col , ":" , test_data[col].isnull().sum())

Pclass : 0
Sex : 0
Age : 86
SibSp : 0
Parch : 0
Fare : 1
Embarked : 0

In [24]:
test_data['Sex'] = test_data.Sex.map({"male":0, "female":1})
test_data['Embarked'] = test_data.Embarked.map({"C":0, "Q":1, "S" :2})

In [25]:
test_data['Age'] = test_data['Age'].fillna(test_data['Age'].median())
test_data['Fare'] = test_data['Fare'].fillna(test_data['Fare'].median())

In [26]:
test_data

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0         3    0  34.5      0      0    7.8292         1
1         3    1  47.0      1      0    7.0000         2
2         2    0  62.0      0      0    9.6875         1
3         3    0  27.0      0      0    8.6625         2
4         3    1  22.0      1      1   12.2875         2
..      ...  ...   ...    ...    ...       ...       ...
413       3    0  27.0      0      0    8.0500         2
414       1    1  39.0      0      0  108.9000         0
415       3    0  38.5      0      0    7.2500         2
416       3    0  27.0      0      0    8.0500         2
417       3    0  27.0      1      1   22.3583         0

[418 rows x 7 columns]

In [27]:
pred = model.predict(test_data)

In [28]:
pred = pred.astype(int)
pred

array([1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1,
       0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0,
       0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0,
       0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0,
       0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1,
       0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0,
       0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0,
       0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       1, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1,
       0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0,
       1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1,
       1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1,
       1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1,
       1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1,
       0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1,
       1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1,
       0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0,
       1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1])

In [29]:
submission = pd.read_csv('gender_submission.csv')
submission['Survived'] = pred
submission.to_csv('submission.csv', index=False)